## numpy

In [1]:
a = [1,2,3]
b = [2,3,4]
a*b

TypeError: can't multiply sequence by non-int of type 'list'

In [3]:
[f*v for f,v in zip(a,b)]

[2, 6, 12]

In [2]:
import numpy
a = numpy.array([1,2,3])
b = numpy.array([2,3,4])
a*b

array([ 2,  6, 12])

In [4]:
import numpy as np
na = np.array([['name', 'gender', 'age'], ['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
na

array([['name', 'gender', 'age'],
       ['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']], dtype='<U11')

## pandas

In [5]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [7]:
df.columns = ['name','gender','age']
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

## series

In [8]:
import pandas as pd
phone = pd.Series([21000,18900,18000])
phone

0    21000
1    18900
2    18000
dtype: int64

In [9]:
import pandas as pd
phone = pd.Series([21000,18900,18000],index=['Iphone 7', 'Oppo', 'Moto'])
phone

Iphone 7    21000
Oppo        18900
Moto        18000
dtype: int64

In [10]:
phone[2]

18000

In [11]:
phone['Oppo']

18900

## dataframe

In [12]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [14]:
df.columns = ['name','gender','age']
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [15]:
df.head(3)

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35

In [16]:
df.tail(3)

   name gender  age
3   ted      M   33
4  jean      F   21
5  lisa      F   20

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   gender  6 non-null      object
 2   age     6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [18]:
df.describe()

             age
count   6.000000
mean   26.833333
std     6.400521
min    20.000000
25%    21.500000
50%    26.000000
75%    32.000000
max    35.000000

In [21]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [22]:
df.gender

0    M
1    F
2    M
3    M
4    F
5    F
Name: gender, dtype: object

#### 有些版本取消了ix

In [ ]:
df.ix[1]

In [25]:
df.iloc[1]

name      mary
gender       F
age         23
Name: 1, dtype: object

In [26]:
df.iloc[2:5]

   name gender  age
2   tom      M   35
3   ted      M   33
4  jean      F   21

In [27]:
df.loc[1]

name      mary
gender       F
age         23
Name: 1, dtype: object

#### loc可以用标签

In [29]:
df.loc[:,'age']

0    29
1    23
2    35
3    33
4    21
5    20
Name: age, dtype: int64

#### iloc只能用索引

In [31]:
df.iloc[:,'age']

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

#### 返回的是布尔值，可以作为标签筛选

In [32]:
df['gender'] == 'M'

0     True
1    False
2     True
3     True
4    False
5    False
Name: gender, dtype: bool

In [33]:
df[df['gender']=='M']

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [34]:
df[(df['gender']=='M')&(df['age']>30)]

  name gender  age
2  tom      M   35
3  ted      M   33

In [35]:
df['employee'] = True
df

    name gender  age  employee
0  frank      M   29      True
1   mary      F   23      True
2    tom      M   35      True
3    ted      M   33      True
4   jean      F   21      True
5   lisa      F   20      True

In [36]:
del df['employee']
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [37]:
df['employee'] = True
df

    name gender  age  employee
0  frank      M   29      True
1   mary      F   23      True
2    tom      M   35      True
3    ted      M   33      True
4   jean      F   21      True
5   lisa      F   20      True

In [39]:
df = df.drop('employee',1)
df

C:\Users\zhesiwode\AppData\Local\Temp\ipykernel_17500\4177766940.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  df = df.drop('employee',1)

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [40]:
df.loc[6] = {'age':20, 'gender': 'F', 'name':'qoo'}
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20
6    qoo      F   20

In [41]:
df = df.drop(6)
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [42]:
df = df.append([{'age':20, 'gender': 'F', 'name':'qoo'}],ignore_index=True)
df

C:\Users\zhesiwode\AppData\Local\Temp\ipykernel_17500\4278464748.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append([{'age':20, 'gender': 'F', 'name':'qoo'}],ignore_index=True)

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20
6    qoo      F   20

In [43]:
df = df.drop(6)
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [2]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [3]:
df.columns = ['name','gender','age']
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [4]:
df['userid'] = [1,2,3,4,5,6]

In [5]:
df

    name gender  age  userid
0  frank      M   29       1
1   mary      F   23       2
2    tom      M   35       3
3    ted      M   33       4
4   jean      F   21       5
5   lisa      F   20       6

In [6]:
df['userid'] = range(101,107)

In [7]:
df

    name gender  age  userid
0  frank      M   29     101
1   mary      F   23     102
2    tom      M   35     103
3    ted      M   33     104
4   jean      F   21     105
5   lisa      F   20     106

In [9]:
df.loc[6] = {'age':20, 'gender': 'F', 'name':'qoo'}

In [10]:
df

    name gender  age  userid
0  frank      M   29   101.0
1   mary      F   23   102.0
2    tom      M   35   103.0
3    ted      M   33   104.0
4   jean      F   21   105.0
5   lisa      F   20   106.0
6    qoo      F   20     NaN

In [12]:
df = df.drop(6)

In [13]:
df

    name gender  age  userid
0  frank      M   29   101.0
1   mary      F   23   102.0
2    tom      M   35   103.0
3    ted      M   33   104.0
4   jean      F   21   105.0
5   lisa      F   20   106.0

In [16]:
df = df.append([{'age':20, 'gender': 'F', 'name':'qoo'}],ignore_index=True)
df

C:\Users\zhesiwode\AppData\Local\Temp\ipykernel_16428\4278464748.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append([{'age':20, 'gender': 'F', 'name':'qoo'}],ignore_index=True)

    name gender  age  userid
0  frank      M   29   101.0
1   mary      F   23   102.0
2    tom      M   35   103.0
3    ted      M   33   104.0
4   jean      F   21   105.0
5   lisa      F   20   106.0
6    qoo      F   20     NaN

In [17]:
df.set_index('userid',inplace=True)

In [18]:
df

         name gender  age
userid
101.0   frank      M   29
102.0    mary      F   23
103.0     tom      M   35
104.0     ted      M   33
105.0    jean      F   21
106.0    lisa      F   20
NaN       qoo      F   20

In [19]:
df.loc[101]

name      frank
gender        M
age          29
Name: 101.0, dtype: object

In [24]:
df.loc[:,'name']

userid
101.0    frank
102.0     mary
103.0      tom
104.0      ted
105.0     jean
106.0     lisa
NaN        qoo
Name: name, dtype: object

In [25]:
df.iloc[2]

name      tom
gender      M
age        35
Name: 103.0, dtype: object

In [28]:
df.iloc[1:3]

        name gender  age
userid
102.0   mary      F   23
103.0    tom      M   35

In [29]:
df.loc[101:105]

         name gender  age
userid
101.0   frank      M   29
102.0    mary      F   23
103.0     tom      M   35
104.0     ted      M   33
105.0    jean      F   21